renesas/rx-driver-package/source/r_tsip_rx_lib/r_tsip_rx_vx.xx/r_tsip_rx/src/targets/rx671/r_tsip_rx_private.h
e_tsip_err_t R_TSIP_Aes128CmacInitSub(uint32_t *InData_KeyType, uint32_t *InData_KeyIndex);
void         R_TSIP_Aes128CmacUpdateSub(uint32_t *InData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128CmacFinalSub(uint32_t *InData_Cmd, uint32_t *InData_Text, uint32_t *InData_DataT,
        uint32_t *InData_DataTLen, uint32_t *OutData_DataT);
e_tsip_err_t R_TSIP_Aes256CmacInitSub(uint32_t *InData_KeyType, uint32_t *InData_KeyIndex);
void         R_TSIP_Aes256CmacUpdateSub(uint32_t *InData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256CmacFinalSub(uint32_t *InData_Cmd, uint32_t *InData_Text, uint32_t *InData_DataT,
        uint32_t *InData_DataTLen, uint32_t *OutData_DataT);

e_tsip_err_t R_TSIP_AESKeyWrapSub(uint32_t *InData_Cmd, uint32_t *InData_KeyIndex, uint32_t KEY_INDEX_SIZE, uint32_t
        *InData_WrappedKeyType, uint32_t *InData_WrappedKeyIndex, uint32_t WRAPPED_KEY_SIZE, uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_AESKeyUnwrapSub(uint32_t *InData_KeyType, uint32_t *InData_Cmd, uint32_t *InData_KeyIndex,
        uint32_t KEY_INDEX_SIZE, uint32_t *InData_WrappedKeyType, uint32_t *InData_Text, uint32_t WRAPPED_KEY_SIZE,
        uint32_t *OutData_KeyIndex);

e_tsip_err_t R_TSIP_Sha1GenerateMessageDigestSub(uint32_t *InData_SHA1InitVal, uint32_t *InData_PaddedMsg,
        uint32_t MAX_CNT, uint32_t *OutData_MsgDigest);
e_tsip_err_t R_TSIP_Sha224256GenerateMessageDigestSub(uint32_t *InData_SHAInitVal, uint32_t *InData_PaddedMsg,
        uint32_t MAX_CNT, uint32_t *OutData_MsgDigest);
e_tsip_err_t R_TSIP_Md5GenerateMessageDigestSub(uint32_t *InData_MD5InitVal, uint32_t *InData_PaddedMsg,
        uint32_t MAX_CNT, uint32_t *OutData_MsgDigest);

e_tsip_err_t R_TSIP_Sha1HmacInitSub(uint32_t *InData_KeyType, uint32_t *InData_KeyIndex);
void         R_TSIP_Sha1HmacUpdateSub(uint32_t *InData_PaddedMsg, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Sha1HmacFinalSub(uint32_t *InData_Cmd, uint32_t *InData_MAC, uint32_t *InData_length,
        uint32_t *OutData_MAC);
e_tsip_err_t R_TSIP_Sha256HmacInitSub(uint32_t *InData_KeyType, uint32_t *InData_Cmd, uint32_t *InData_KeyIndex);
void         R_TSIP_Sha256HmacUpdateSub(uint32_t *InData_PaddedMsg, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Sha256HmacFinalSub(uint32_t *InData_Cmd, uint32_t *InData_MAC, uint32_t *InData_length,
        uint32_t *OutData_MAC);

e_tsip_err_t R_TSIP_TdesEncryptDecryptInitSub(uint32_t *InData_Cmd, uint32_t *InData_KeyIndex, uint32_t *InData_IV);
void R_TSIP_TdesEncryptDecryptUpdateSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_TdesEncryptDecryptFinalSub(void);
e_tsip_err_t R_TSIP_Arc4EncryptDecryptInitSub(uint32_t *InData_KeyIndex);
void R_TSIP_Arc4EncryptDecryptUpdateSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Arc4EncryptDecryptFinalSub(void);

e_tsip_err_t R_TSIP_TlsRootCertificateVerificationSub(uint32_t *InData_Sel_PubKeyType, uint32_t *InData_Certificates,
        uint32_t *InData_CertificatesLength, uint32_t *InData_Signature, uint32_t *InData_CertificatesInfo,
        uint32_t *OutData_PubKey);
e_tsip_err_t R_TSIP_TlsCertificateVerificationSub(uint32_t *InData_Sel_InDataPubKeyType,
        uint32_t *InData_Sel_OutDataPubKeyType, uint32_t *InData_PubKey,
        uint32_t *InData_TBSCertificate, uint32_t *InData_TBSCertificateLength, uint32_t *InData_Signature,
        uint32_t *InData_TBSCertificateInfo, uint32_t *OutData_PubKey);
e_tsip_err_t R_TSIP_TlsEncryptPreMasterSecretSub(uint32_t *InData_PubKey, uint32_t *InData_PreMasterSecret,
        uint32_t *OutData_PreMasterSecret);
e_tsip_err_t R_TSIP_TlsGeneratePreMasterSecretSub(uint32_t *OutData_PreMasterSecret);
e_tsip_err_t R_TSIP_TlsGenerateMasterSecretSub(uint32_t *InData_Sel_CipherSuite, uint32_t *InData_PreMasterSecret,
        uint32_t *InData_ClientRandom, uint32_t *InData_ServerRandom, uint32_t *OutData_MasterSecret);
e_tsip_err_t R_TSIP_TlsGenerateSessionKeySub(uint32_t *InData_Sel_CipherSuite, uint32_t *InData_MasterSecret,
        uint32_t *InData_ClientRandom, uint32_t *InData_ServerRandom, uint32_t *InData_NonceExplicit,
        uint32_t *OutData_ClientMACKeyOperationCode, uint32_t *OutData_ServerMACKeyOperationCode,
        uint32_t *OutData_ClientEncKeyOperationCode, uint32_t *OutData_ServerEncKeyOperationCode,
        uint32_t* OutData_ClientIV, uint32_t* OutData_ServerIV);
e_tsip_err_t R_TSIP_TlsGenerateVerifyDataSub(uint32_t *InData_Sel_VerifyData, uint32_t *InData_MasterSecret,
        uint32_t *InData_HandShakeHash, uint32_t *OutData_VerifyData);
e_tsip_err_t R_TSIP_TlsGeneratePreMasterSecretWithEccP256KeySub(uint32_t *InData_PubKey, uint32_t *InData_KeyIndex,
        uint32_t *OutData_PreMasterSecretIndex);
e_tsip_err_t R_TSIP_TlsServersEphemeralEcdhPublicKeyRetrievesSub(uint32_t *InData_Sel_PubKeyType,
        uint32_t *InData_ClientRandom, uint32_t *InData_ServerRandom, uint32_t *InData_Sel_CompressType,
        uint32_t *InData_SKE_Message, uint32_t *InData_SKE_Signature, uint32_t *InData_PubKey,
        uint32_t *OutData_EphemeralPubKey);
e_tsip_err_t R_TSIP_TlsGenerateExtendedMasterSecretSub(uint32_t *InData_Sel_CipherSuite,
        uint32_t *InData_PreMasterSecret, uint32_t *InData_MsgHash, uint32_t *OutData_ExMasterSecret);

e_tsip_err_t R_TSIP_GenerateTls13P256EccKeyIndexSub(uint32_t * InData_Cmd, uint32_t * InData_Handle,
        uint32_t * OutData_KeyIndex, uint32_t * OutData_PubKey);
e_tsip_err_t R_TSIP_Tls13GenerateEcdheSharedSecretSub(uint32_t * InData_Cmd, uint32_t * InData_PubKey,
        uint32_t * InData_KeyIndex, uint32_t * OutData_SharedSecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateHandshakeSecretSub(uint32_t * InData_SharedSecretKeyIndex,
        uint32_t * OutData_Handshake_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateServerHandshakeTrafficKeySub(uint32_t * InData_Cmd,
        uint32_t * InData_Handshake_SecretKeyIndex, uint32_t * InData_MsgHash,
        uint32_t * OutData_ServerWriteKeyIndex, uint32_t * OutData_ServerFinishedKeyIndex);
e_tsip_err_t R_TSIP_Tls13ServerHandshakeVerificationSub(uint32_t * InData_Cmd,
        uint32_t * InData_ServerFinishedKeyIndex, uint32_t * InData_MsgHash, uint32_t * InData_ServerFinished,
        uint32_t * OutData_VerifyDataIndex);
e_tsip_err_t R_TSIP_Tls13GenerateClientHandshakeTrafficKeySub(uint32_t * InData_Cmd,
        uint32_t * InData_Handshake_SecretKeyIndex, uint32_t * InData_MsgHash, uint32_t * OutData_ClientWriteKeyIndex,
        uint32_t * OutData_ClientFinishedKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateMasterSecretSub(uint32_t * InData_Cmd, uint32_t * InData_Handshake_SecretKeyIndex,
        uint32_t * InData_VerifyDataIndex, uint32_t * OutData_Handle, uint32_t * OutData_Master_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateApplicationTrafficKeySub(uint32_t * InData_Cmd, uint32_t * InData_Handle,
        uint32_t * InData_Master_SecretKeyIndex, uint32_t * InData_MsgHash,
        uint32_t * OutData_ServerApplicationSecretKeyIndex, uint32_t * OutData_ClientApplicationSecretKeyIndex,
        uint32_t * OutData_ServerWriteKeyIndex, uint32_t * OutData_ClientWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13UpdateApplicationTrafficKeySub(uint32_t * InData_Cmd, uint32_t * InData_UpdateKeyType,
        uint32_t * InData_Handle, uint32_t * InData_ApplicationSecretKeyIndex,
        uint32_t * OutData_ApplicationSecretKeyIndex, uint32_t * OutData_ApplicationWriteKeyIndex);

e_tsip_err_t R_TSIP_Rsa1024ModularExponentEncryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa1024ModularExponentDecryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa2048ModularExponentEncryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa2048ModularExponentDecryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa3072ModularExponentEncryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text, 
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa4096ModularExponentEncryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text, 
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa2048DhKeyAgreementSub(uint32_t *InData_KeyIndex, uint32_t *InData_PrimNumIndex,
        uint32_t *InData_Message, uint32_t *InData_ModExp, uint32_t *OutData_ModExp);

e_tsip_err_t R_TSIP_EcdsaSigunatureGenerateSub(uint32_t *InData_Cmd, uint32_t *InData_KeyIndex,
        uint32_t *InData_MsgDgst, uint32_t *OutData_Signature);
e_tsip_err_t R_TSIP_EcdsaP384SigunatureGenerateSub(uint32_t *InData_KeyIndex,
        uint32_t *InData_MsgDgst, uint32_t *OutData_Signature);
e_tsip_err_t R_TSIP_EcdsaSigunatureVerificationSub(uint32_t *InData_Cmd, uint32_t *InData_KeyIndex,
        uint32_t *InData_MsgDgst, uint32_t *InData_Signature);
e_tsip_err_t R_TSIP_EcdsaP384SigunatureVerificationSub(uint32_t *InData_KeyIndex,
        uint32_t *InData_MsgDgst, uint32_t *InData_Signature);

e_tsip_err_t R_TSIP_DlmsCosemQeuSignatureVerificationSub(uint32_t *InData_Cmd, uint32_t *InData_KeyIndex,
        uint32_t *InData_data, uint32_t *InData_Signature, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_DlmsCosemQevSignatureGenerationSub(uint32_t *InData_Cmd, uint32_t *InData_KeyType,
        uint32_t *InData_PubKeyIndex, uint32_t *InData_PrivKeyIndex, uint32_t *InData_key_id, uint32_t *OutData_data,
        uint32_t *OutData_Signature, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_DlmsCosemCalculateZSub(uint32_t *InData_KeyType, uint32_t *InData_PubKeyIndex,
        uint32_t *InData_PrivKeyIndex, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_DlmsCosemCalculateKekSub(uint32_t *InData_KeyIndexType, uint32_t *InData_KeyIndex,
        uint32_t *InData_KDFType, uint32_t *InData_PaddedMsg, uint32_t MAX_CNT, uint32_t *InData_SaltKeyIndex,
        uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_EcdheP512KeyAgreementSub(uint32_t *InData_KeyIndex, uint32_t *InData_PubKey,
        uint32_t *OutData_PubKey);

void R_TSIP_TlsRootCertificateVerificationSubSub(void);
void R_TSIP_TlsGenerateSubSub(void);

void R_TSIP_SelfCheck1SubSub(void);
void R_TSIP_SelfCheck2SubSub(void);

void RX671_func000(uint32_t *InData_PaddedMsg, int32_t MAX_CNT);
void RX671_func001(void);
void RX671_func002(void);
void RX671_func003(uint32_t* ARG1);
void RX671_func004(uint32_t ARG1);
void RX671_func005(uint32_t ARG1);
void RX671_func006(void);
void RX671_func007(void);
void RX671_func008(void);
void RX671_func009(void);
void RX671_func010(uint32_t ARG1);
void RX671_func011(uint32_t *ARG1);
void RX671_func015(void);
void RX671_func022(void);
void RX671_func023(void);
void RX671_func025(uint32_t ARG1);
void RX671_func027(uint32_t ARG1);
void RX671_func028(uint32_t ARG1);
void RX671_func030(void);
void RX671_func031(uint32_t *ARG1);
void RX671_func040(uint32_t ARG1);
void RX671_func041(uint32_t ARG1);
void RX671_func050(uint32_t ARG1);
void RX671_func051(void);
void RX671_func052(uint32_t ARG1);
void RX671_func053(uint32_t ARG1);
void RX671_func054(uint32_t ARG1, uint32_t ARG2);
void RX671_func060(void);
void RX671_func061(void);
void RX671_func070(void);
void RX671_func071(void);
void RX671_func072(void);
void RX671_func075(void);
void RX671_func080(void);
void RX671_func100(uint32_t ARG1, uint32_t ARG2, uint32_t ARG3, uint32_t ARG4);
void RX671_func101(uint32_t ARG1, uint32_t ARG2, uint32_t ARG3, uint32_t ARG4);
void RX671_func102(uint32_t ARG1, uint32_t ARG2, uint32_t ARG3, uint32_t ARG4);
void RX671_func103(void);
void RX671_func200(void);
void RX671_func202(void);
void RX671_func205(void);
void RX671_func206(void);
void RX671_func207(void);
void RX671_func304(void);
void RX671_func307(void);
void RX671_func308(void);
void RX671_func309(void);
void RX671_func310(void);
void RX671_func311(void);
void RX671_func312(uint32_t ARG1);
void RX671_func313(uint32_t ARG1);
void RX671_func314(uint32_t ARG1);
void RX671_func315(uint32_t ARG1);
void RX671_func316(void);
void RX671_func317(void);
void RX671_func318(void);
void RX671_func319(uint32_t ARG1);
void RX671_func320(uint32_t ARG1);
void RX671_func321(uint32_t ARG1);
void RX671_func322(uint32_t ARG1);
void RX671_func323(void);
void RX671_func324(void);
void RX671_func325(void);

void firm_mac_read(uint32_t *InData_Program);

e_tsip_err_t rsassa_emsa_pss_encode(tsip_rsa_byte_data_t *message, uint8_t hash_type, uint32_t em_bits, uint8_t *em);

/**********************************************************************************************************************
 * Function Name: change_endian_long
 * Description  : change endian
 * Arguments    : data -
 *                    input data
 * Return Value : the data changing endian
 *********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(change_endian_long)
uint32_t change_endian_long(uint32_t data)
{
#if defined __LIT
    /* Casting is valid because it matches the type to the right side or argument. */
    return R_BSP_REVL(data);
#else
    return data;
#endif  /* defined __LIT */
}
/*********************************
 End of function change_endian_long
 **********************************/

#endif /* R_TSIP_RX_PRIVATE_HEADER_FILE */
